The  ViewShapeBuilder  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  ShapeBuilder  .)
ViewNormal
 Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector. This is used to validate incoming geometry - it must be orthogonal to the viewNormal.
ViewType
 View type where the view-specific shape currently being built will be used
 See Also
  ViewShapeBuilder Class
  Autodesk.Revit.DB Namespace